let PhishuntURLs = externaldata (Url: string) ["https://phishunt.io/feed.txt"]
//exclude false positives
| where Url !in ("https://www.google.com/chrome/","https://www.microsoft.com/en-us/microsoft-teams/log-in");
EmailUrlInfo
| where Url has_any (PhishuntURLs)
| join EmailEvents on NetworkMessageId
