let TwitterFeed_today = externaldata (Date: string, Src: string, Art: string, Value: string) ["https://raw.githubusercontent.com/0xDanielLopez/TweetFeed/master/today.csv"];
let TwitterFeed_week = externaldata (Date: string, Src: string, Art: string, Value: string) ["https://raw.githubusercontent.com/0xDanielLopez/TweetFeed/master/week.csv"];
let TwitterFeed_month = externaldata (Date: string, Src: string, Art: string, Value: string) ["https://raw.githubusercontent.com/0xDanielLopez/TweetFeed/master/month.csv"];
EmailUrlInfo 
| join EmailEvents on NetworkMessageId
| join (TwitterFeed_today
| where Value == "url"
) on $left.Url == $right.Value
| join (TwitterFeed_week
| where Value == "url"
) on $left.Url == $right.Value
| join (TwitterFeed_month
| where Value == "url"
<<<<<<< HEAD
) on $left.Url == $right.Value
=======
) on $left.Url == $right.Value
>>>>>>> 9fce6d9873a895630003e1099cafa3916818700d
