let TweetFeed_today = externaldata (Date: string, Src: string, Art: string, Value: string) ["https://raw.githubusercontent.com/0xDanielLopez/TweetFeed/master/today.csv"];
let TweetFeed_week = externaldata (Date: string, Src: string, Art: string, Value: string) ["https://raw.githubusercontent.com/0xDanielLopez/TweetFeed/master/week.csv"];
let TweetFeed_month = externaldata (Date: string, Src: string, Art: string, Value: string) ["https://raw.githubusercontent.com/0xDanielLopez/TweetFeed/master/month.csv"];
DeviceNetworkEvents
| join (TweetFeed_today
| where Art == "url"
) on $left.RemoteUrl == $right.Art
| join (TweetFeed_week
| where Art == "url"
) on $left.RemoteUrl == $right.Art
| join (TweetFeed_month
| where Art == "url"
) on $left.RemoteUrl == $right.Art