BehaviorAnalytics
| extend ActionUncommonlyPerformedbyUser = ActivityInsights.ActionUncommonlyPerformedByUser
| where ActionUncommonlyPerformedbyUser == "True"
//| extend AppUncommonlyUsedByUser  = ActivityInsights.AppUncommonlyUsedByUser
//| where AppUncommonlyUsedByUser == "True"
| extend ISPUncommonlyUsedByUser = ActivityInsights.ISPUncommonlyUsedByUser
| where ISPUncommonlyUsedByUser == "True"
| extend CountryUncommonlyConnectedFromByUser = ActivityInsights.CountryUncommonlyConnectedFromByUser
| where CountryUncommonlyConnectedFromByUser == "True"
| extend FirstTimeUserConnectedFromDevice = ActivityInsights.FirstTimeUserConnectedFromDevice
| where FirstTimeUserConnectedFromDevice == "True"
| where InvestigationPriority >5
