BehaviorAnalytics
| extend ActionUncommonlyPerformedbyUser = tostring(ActivityInsights.ActionUncommonlyPerformedByUser)
| where ActionUncommonlyPerformedbyUser == "True"
| extend ISPUncommonlyUsedByUser = tostring(ActivityInsights.ISPUncommonlyUsedByUser)
| where ISPUncommonlyUsedByUser == "True"
| extend CountryUncommonlyConnectedFromByUser = tostring(ActivityInsights.CountryUncommonlyConnectedFromByUser)
| where CountryUncommonlyConnectedFromByUser == "True"
| extend FirstTimeUserConnectedFromDevice = tostring(ActivityInsights.FirstTimeUserConnectedFromDevice)
| where FirstTimeUserConnectedFromDevice == "True"
| extend DeviceUncommonlyUsedAmongPeers = tostring(ActivityInsights.DeviceUncommonlyUsedAmongPeers)
| where DeviceUncommonlyUsedAmongPeers == "True"
| where InvestigationPriority > 5
